[
   {
      "title": "The ultimate Website builder for Startups Ready to be found online",
      "rating": "Rating: 9 out of 10",
      "date": "May 24, 2021",
      "body": "Wix was a website platform that I had recommended to a friend who wanted to create her own website for her business as she could not afford to pay someone else to do it for her. After using Wix a few years before her, I knew it was a tool she could use to get a basic website up and running to start promoting her services. Fast forward 2 years, I now manage and update her Wix website and use several features to optimise her website and its performance.",
      "reviewerName": "Ayo Bamgbose, Assoc CIPD, MSc"
    },
    {
      "title": "Let create with Wix",
      "rating": "Rating: 9 out of 10",
      "date": "May 24, 2021",
      "body": "Wix is the most essential element for me especially when it comes to the creation of websites. Till now I have designed many websites not only for my own company but I helped my mates as well. This is a very user-friendly software that never requires any complex coding and provides me various templates to create what I exactly think.",
      "reviewerName": "Kate Woodward"
    },
    {
      "title": "Wix Kicks!",
      "rating": "Rating: 9 out of 10",
      "date": "May 24, 2021",
      "body": "Wix is being used a tool to help our primary content creators improve their skills for blog writing and blog design. As a small company that has traditionally reached clients and candidates through referrals, word-of-mouth and in-person events, our website and blog are certainly important but we have yet to see a need to tap outside resources for enhancing the design or populating the content. Thus, one person has been managing essentially every component, from developing content to promoting that content to tracking a variety of metrics. Wix was the platform they wanted to work off because of its user-friendliness, its sleek style, and the formatting and visual options it offers users. We have accounts with other website editors and content generators, but Wix is what was found to be most agreeable.",
      "reviewerName": "Kristen Zatina"
    },
    {
      "title": "No code web application creator",
      "rating": "Rating: 9 out of 10",
      "date": "May 24, 2021",
      "body": "We needed web application to introduce what my department is doing. Then we search around to find a solution to without deep technical knowledge. Therefore Wix answered our business requirements.",
      "reviewerName": ""
    },
    {
      "title": "Easy-to-use Wix",
      "rating": "Rating: 8 out of 10",
      "date": "May 24, 2021",
      "body": "Our organization has used it to built a website by one department. It addresses the issue of having to build a website from scratch. There is customer support from Wix which is quite helpful. Wix is flexible, it offers stunning designs, has automatic site backup and the price is acceptable.",
      "reviewerName": ""
    },
    {
      "title": "The Truth About Wix",
      "rating": "Rating: 10 out of 10",
      "date": "May 24, 2021",
      "body": "Wix is used by our entire company. It is the platform that we use to communicate with our customers, our shop is on the Wix platform, and the branding is done using their tools. We have been recommending it to multiple other business partners and / or sister companies, and everyone had been satisfied with it.",
      "reviewerName": ""
    },
    {
      "title": "Wix - You get what you pay for",
      "rating": "Rating: 1 out of 10",
      "date": "May 24, 2021",
      "body": "I used Wix as the CMS for a nonprofit organization who retained me to build an inexpensive website for their organization. The purpose was to get the word out about a product being marketed by the organization that would raise awareness and money for shelter animals.",
      "reviewerName": "Jessica Groff"
    },
    {
      "title": "An affordable and super easy platform for creating your first website",
      "rating": "Rating: 9 out of 10",
      "date": "May 24, 2021",
      "body": "It is used to create websites for clients who specifically request the use of it. It's an easy solution for clients who are not versed in the back end of web development as the WYSIWYG in Wix is extremely user-friendly to use for almost anyone and has a lot of options.",
      "reviewerName": ""
    },
    {
      "title": "For beginners, Wix is the way to go",
      "rating": "Rating: 8 out of 10",
      "date": "May 24, 2021",
      "body": "We connect our proprietary marketing software to Wix websites. This means connecting things such as analytics and form fill leads as well as a chatbot feature. The experience we have had while making these connections has been overall pretty good. The user interface is simple and easy for non-tech savvy clients to navigate through Wix.",
      "reviewerName": ""
    },
    {
      "title": "The perfect one stop shop for website design and creation",
      "rating": "Rating: 9 out of 10",
      "date": "May 19, 2021",
      "body": "As a computer consultant I use Wix to design websites for my clients. With all of it's templates, plugins, and robust features it's a great starting point for any website. Great integrations with many of todays top website add ons for ecommerce among other things. It's faqs, tutorials and straight forward features make it easy for anyone to get a site up in running in no time.",
      "reviewerName": ""
    },
    {
      "title": "Great basic website designer!",
      "rating": "Rating: 7 out of 10",
      "date": "April 22, 2021",
      "body": "I use Wix as a training tool for the call center I work for. They can use it as a resource also to reference different aspects of how a call should go. Also, it has all of our call scripts and information that customers may inquire about. There are buttons for each question a customer may have, with the proper response for our agent to use.",
      "reviewerName": "Dan Hanna"
    },
    {
      "title": "Wix is an ok CMS",
      "rating": "Rating: 7 out of 10",
      "date": "March 11, 2020",
      "body": "The owner of the company that I created a Wix website for was very specific for how he wanted his website to look and feel. With this, my only option was to create a site on Wix because it allowed me to drag and drop components exactly where they needed to go so the WYSIWYG is fantastic for this.\n\nHowever, SEO tools and options are lacking, even with the option to add custom HTML code.\n\nThe image library doesn't function ideally but it can get the job done.",
      "reviewerName": "Erin Harris"
    },
    {
      "title": "Flip your university athletic class with Wix",
      "rating": "Rating: 10 out of 10",
      "date": "March 11, 2020",
      "body": "Wix is a personal solution to a departmental problem. As a tennis instructor to university students, my biggest problem is not having enough time with students. Wix has enabled me to adopt a flipped-classroom model in which I reserve class time for practice and questions. All other instruction is conducted on the students' respective schedules outside of class. I developed a Wix website containing instructional information. I email students regularly asking them to review specific information before coming to class.",
      "reviewerName": "Bryan Tanner"
    },
    {
      "title": "Give your business an outstanding image.",
      "rating": "Rating: 10 out of 10",
      "date": "March 10, 2020",
      "body": "Wix has given me the ability to continuously change, grow, and publish my website using an extremely user-friendly platform.",
      "reviewerName": "jacob rappeport"
    },
    {
      "title": "Comfortable, intuitive website design at a great price!",
      "rating": "Rating: 10 out of 10",
      "date": "March 09, 2020",
      "body": "I have been utilizing Wix within my position in order to build websites and further expand my expertise with web page design/modification. It is currently being used by myself only, though I’ve started training my team on using it as well. It currently allows us to build a professional website quickly and easily, without the need for much coding.",
      "reviewerName": ""
    },
    {
      "title": "Wix is great for new users but limiting for advanced users",
      "rating": "Rating: 5 out of 10",
      "date": "March 05, 2020",
      "body": "Wix is no longer being used in our organisation. Although they are making efforts to foster relationships with agencies, ultimately they are more concerned about the end-user, which is completely fine because that is their business model, but as an agency, I can't justify using Wix for several reasons which we'll get into in the review.",
      "reviewerName": ""
    },
    {
      "title": "Build your custom website easy and without the coding hassle.",
      "rating": "Rating: 8 out of 10",
      "date": "March 04, 2020",
      "body": "Wix was used to build a website for our non-profit counterpart and the school we run as a part of the Sikh Onstitute. Wix is used to run the school website. It is used to solve the problem of communication, information update, and sharing.",
      "reviewerName": ""
    },
    {
      "title": "Easy website builder with many great features",
      "rating": "Rating: 10 out of 10",
      "date": "March 03, 2020",
      "body": "We use Wix mainly within our marketing department for students who make their internship during the summer with us. They are usually coming from the business program and most of their projects require building websites. Here comes the role of Wix as one of the easiest and most user-friendly platforms that allows anyone to build a website in a professional way without having to know a single code.",
      "reviewerName": "Alfred Simmons"
    },
    {
      "title": "Stand Out With Wix",
      "rating": "Rating: 9 out of 10",
      "date": "March 03, 2020",
      "body": "I use Wix personally as a resume. I created a website to act as a more dynamic place to highlight some of my technical and marketing skills.",
      "reviewerName": ""
    },
    {
      "title": "Wix is a win-win for taking your business to the next level with an easy website builder.",
      "rating": "Rating: 8 out of 10",
      "date": "February 28, 2020",
      "body": "We used Wix to create our current client's website. This made it easier to create our own, versus having to outsource this kind of service, which can get very expensive and doesn't always correctly interpret the company's vision since they do not work in it. Also, Wix makes it easier to make any changes to reflect sales or other things happening in the company.",
      "reviewerName": "Julia Gonzalez"
    },
    {
      "title": "Good options for beginners",
      "rating": "Rating: 6 out of 10",
      "date": "February 27, 2020",
      "body": "We have worked with Wix with several agency clients. It has been a site builder used by clients that are looking for a free or low-cost website builder that can be used for someone without coding experience.",
      "reviewerName": ""
    },
    {
      "title": "Wix is a great website builder for small businesses",
      "rating": "Rating: 8 out of 10",
      "date": "February 26, 2020",
      "body": "Wix is used by our entire organization. It is the platform that we use to communicate with our customers, our shop is on the Wix platform, and the branding is done using their tools. We have been recommending it to multiple other business partners and / or sister companies, and everyone had been satisfied with it.",
      "reviewerName": ""
    },
    {
      "title": "Wix makes web development easy",
      "rating": "Rating: 10 out of 10",
      "date": "February 12, 2020",
      "body": "We use Wix daily to implement easy to build, affordable websites for our clients. We specialize in small businesses, many of which have a minimal marketing budget but need exposure on the internet. We love being able to quickly train our clients to use the backend and update the website when they need to.",
      "reviewerName": ""
    },
    {
      "title": "Wix - The easy to use website creator",
      "rating": "Rating: 9 out of 10",
      "date": "February 08, 2020",
      "body": "I use Wix, both personally and professionally. I manage my own website and my boss' site. Personally, it functions as an additional marketing tool alongside my Instagram and is an excellent source of income as well as with Wix's business tools and paywalls. Professionally, it extends my brand potential as a web developer and graphic designer.",
      "reviewerName": "Sasha Jacobsen"
    },
    {
      "title": "Wix Helped Get Us On Our Feet",
      "rating": "Rating: 10 out of 10",
      "date": "October 21, 2019",
      "body": "We started with Wix as a solution to not having a website. Our company was purchased by an investment firm, and we were in the process of being carved out from our parent organization. We had a major product launch coming up at the end of 2018 and needed to have a website in place for it; after researching, Wix seemed like the best and easiest option for getting a page up. It turned out to be so easy that I recreated our whole web presence using Wix (our former parent organization had completed a web redesign earlier that eschewed much of the information our customers need to make purchasing decisions; this was our chance to rebuild that information). Today, we have a more robust web solution in place, but Wix remains our top option for landing pages and \"quick need\" pages which do not necessitate an entire development process.",
      "reviewerName": "Josh Kratovil"
    },
    {
      "title": "Tons of customization, but far too easy to mess up.",
      "rating": "Rating: 3 out of 10",
      "date": "September 30, 2019",
      "body": "When I switched from WordPress, I spent several months working with both Wix and Squarespace. I ultimately decided to go with Squarespace, as I found that although Wix has more customization options, it was more difficult for our clients to use. Clients liked the \"do anything\" interface but quickly messed up their sites, which was a hassle for everyone.",
      "reviewerName": "Andrew Folts"
    },
    {
      "title": "Wix Fast and Free to Start, But Should You?",
      "rating": "Rating: 7 out of 10",
      "date": "July 25, 2019",
      "body": "Wix is used for managing a website. It contains current information, archives, and events calendar and a gallery. Wix is used by three people to manage the website. It is a fairly user friendly way to build a website once the user becomes familiar with the setup. The Free package is nice but paid does seem better.",
      "reviewerName": "Heath Achatz"
    },
    {
      "title": "Wix - the last website authoring tool you will ever need",
      "rating": "Rating: 10 out of 10",
      "date": "July 11, 2019",
      "body": "In 2017 we moved our organization's website from a Wordpress site to Wix and we haven't looked back. Representing our company on the web is important and Wix has become our one-stop shop for website design. It's ease of use and multiple design templates have made training our department heads a breeze. We now have a web presence, with responsive pages and mobile compatibility, all of which we did not possess before our move to Wix.",
      "reviewerName": ""
    },
    {
      "title": "Penetrating your target market with a quick and professional website",
      "rating": "Rating: 9 out of 10",
      "date": "June 29, 2019",
      "body": "Wix is used by my company to develop and frequently modify our website. I developed and patented a carbon capture technology back in 2007, and after much searching selected Wix to build our website. I was pleased with the website from the start, as it was relatively easy to build given the tools inherent in Wix. It addresses the fundamental need of a small technology company: to get noticed. And it does it effectively.",
      "reviewerName": "Uday Singh"
    },
    {
      "title": "Good Start for Website Design",
      "rating": "Rating: 8 out of 10",
      "date": "February 27, 2019",
      "body": "We use Wix when it comes to having students create websites, teacher blogs/doc logs, students digital portfolios, etc. It is often part of a choice that teachers share with their students when they have an assignment/creative task and are looking for a program to design a website. I have found that teachers across all subjects and departments and across our district have utilized Wix in one way or another. Website design in general, or having students create sites in which they share their information with a wider audience is a great skill that they need to practice and Wix helps with this.",
      "reviewerName": ""
    },
    {
      "title": "Great for Small Businesses",
      "rating": "Rating: 9 out of 10",
      "date": "February 07, 2019",
      "body": "Wix is currently being used for our online store for our farmer's market. We are only open seasonally because we are an on-farm Market, so we only open when we have crops being harvested. We also offer a wide variety of non-perishable food items. We get people wanting to purchase items when we are closed, which is why we started using Wix to help us sell when we are closed.",
      "reviewerName": "Kirsten Rodriguez"
    },
    {
      "title": "Wix is the best for beginners in need of a beautiful website fast!",
      "rating": "Rating: 9 out of 10",
      "date": "January 30, 2019",
      "body": "I have used Wix to create websites for an entire organization, but I've mostly used it to create landing pages and/or mini sites for specific aspects of an organization like a campaign for a new product or a registration site for an upcoming conference. Wix is perfect for small businesses who cannot afford to invest in an in-house web developer or designer but need a professional, visually-pleasing website.",
      "reviewerName": "Brittney Collier"
    },
    {
      "title": "Marginal, budget-friendly solution for first-timers and technophobes",
      "rating": "Rating: 3 out of 10",
      "date": "January 19, 2019",
      "body": "I used Wix to build my first website, so the problem it solved was getting me my first, rudimentary online presence. Their marketing messages are correct: even a technology and design novice can use Wix to build a passable, even attractive, website. If you're not excited about embarking down a big learning curve to get a website up and running, and you need something that's relatively simple, Wix may be a fine choice for you.",
      "reviewerName": ""
    },
    {
      "title": "Good, but sometimes glitchy, software for website development.",
      "rating": "Rating: 6 out of 10",
      "date": "January 18, 2019",
      "body": "We use Wix to develop customer friendly, easy to use websites with advanced integration options for our clients. It is useful in the context of developing these websites but not for other purposes, which saves us from actually hiring a developer and manually coding and developing a website directly, which would be much more expensive even if it had more customizable options.",
      "reviewerName": ""
    },
    {
      "title": "Websites from Scratch to Published with No Stress",
      "rating": "Rating: 7 out of 10",
      "date": "January 15, 2019",
      "body": "Wix is a browser-based webpage builder editor and hosting service, allowing users to create personal or business webpages with no or minimal coding experience required. In our Digital Media program, we allow students to utilize Wix to build a web portfolio for their work, including photography, graphic designs, and video productions. We also utilize Wix for a course overview site for new and prospective students to view past projects, learn more about our program, and to contact us with questions via a web form on the site.",
      "reviewerName": "Dan Talvi"
    },
    {
      "title": "Wix is a great, user-friendly way to build a website!",
      "rating": "Rating: 9 out of 10",
      "date": "January 04, 2019",
      "body": "We used Wix when we were shopping around for a way to build a simple website with a custom domain name and a blog. Wix is one of the most simple and user-friendly ways to build your website.",
      "reviewerName": "Matt Graf"
    }
  ]